apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_tim_v3_m0.h
/* Register Addresses *******************************************************/

/* Advanced Timers - TIM1 */

#define STM32_TIM1_CR1            (STM32_TIM1_BASE+STM32_ATIM_CR1_OFFSET)
#define STM32_TIM1_CR2            (STM32_TIM1_BASE+STM32_ATIM_CR2_OFFSET)
#define STM32_TIM1_SMCR           (STM32_TIM1_BASE+STM32_ATIM_SMCR_OFFSET)
#define STM32_TIM1_DIER           (STM32_TIM1_BASE+STM32_ATIM_DIER_OFFSET)
#define STM32_TIM1_SR             (STM32_TIM1_BASE+STM32_ATIM_SR_OFFSET)
#define STM32_TIM1_EGR            (STM32_TIM1_BASE+STM32_ATIM_EGR_OFFSET)
#define STM32_TIM1_CCMR1          (STM32_TIM1_BASE+STM32_ATIM_CCMR1_OFFSET)
#define STM32_TIM1_CCMR2          (STM32_TIM1_BASE+STM32_ATIM_CCMR2_OFFSET)
#define STM32_TIM1_CCER           (STM32_TIM1_BASE+STM32_ATIM_CCER_OFFSET)
#define STM32_TIM1_CNT            (STM32_TIM1_BASE+STM32_ATIM_CNT_OFFSET)
#define STM32_TIM1_PSC            (STM32_TIM1_BASE+STM32_ATIM_PSC_OFFSET)
#define STM32_TIM1_ARR            (STM32_TIM1_BASE+STM32_ATIM_ARR_OFFSET)
#define STM32_TIM1_RCR            (STM32_TIM1_BASE+STM32_ATIM_RCR_OFFSET)
#define STM32_TIM1_CCR1           (STM32_TIM1_BASE+STM32_ATIM_CCR1_OFFSET)
#define STM32_TIM1_CCR2           (STM32_TIM1_BASE+STM32_ATIM_CCR2_OFFSET)
#define STM32_TIM1_CCR3           (STM32_TIM1_BASE+STM32_ATIM_CCR3_OFFSET)
#define STM32_TIM1_CCR4           (STM32_TIM1_BASE+STM32_ATIM_CCR4_OFFSET)
#define STM32_TIM1_BDTR           (STM32_TIM1_BASE+STM32_ATIM_BDTR_OFFSET)
#define STM32_TIM1_DCR            (STM32_TIM1_BASE+STM32_ATIM_DCR_OFFSET)
#define STM32_TIM1_DMAR           (STM32_TIM1_BASE+STM32_ATIM_DMAR_OFFSET)
#define STM32_TIM1_OR1            (STM32_TIM1_BASE+STM32_ATIM_OR1_OFFSET)
#define STM32_TIM1_CCMR3          (STM32_TIM1_BASE+STM32_ATIM_CCMR3_OFFSET)
#define STM32_TIM1_CCR5           (STM32_TIM1_BASE+STM32_ATIM_CCR5_OFFSET)
#define STM32_TIM1_CCR6           (STM32_TIM1_BASE+STM32_ATIM_CCR6_OFFSET)
#define STM32_TIM1_AF1            (STM32_TIM1_BASE+STM32_ATIM_AF1_OFFSET)
#define STM32_TIM1_AF2            (STM32_TIM1_BASE+STM32_ATIM_AF2_OFFSET)
#define STM32_TIM1_TISEL          (STM32_TIM1_BASE+STM32_ATIM_TISEL_OFFSET)

/* 16-bit General Timers TIM3 and TIM14-17 */

#define STM32_TIM3_CR1            (STM32_TIM3_BASE+STM32_GTIM_CR1_OFFSET)
#define STM32_TIM3_CR2            (STM32_TIM3_BASE+STM32_GTIM_CR2_OFFSET)
#define STM32_TIM3_SMCR           (STM32_TIM3_BASE+STM32_GTIM_SMCR_OFFSET)
#define STM32_TIM3_DIER           (STM32_TIM3_BASE+STM32_GTIM_DIER_OFFSET)
#define STM32_TIM3_SR             (STM32_TIM3_BASE+STM32_GTIM_SR_OFFSET)
#define STM32_TIM3_EGR            (STM32_TIM3_BASE+STM32_GTIM_EGR_OFFSET)
#define STM32_TIM3_CCMR1          (STM32_TIM3_BASE+STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM3_CCMR2          (STM32_TIM3_BASE+STM32_GTIM_CCMR2_OFFSET)
#define STM32_TIM3_CCER           (STM32_TIM3_BASE+STM32_GTIM_CCER_OFFSET)
#define STM32_TIM3_CNT            (STM32_TIM3_BASE+STM32_GTIM_CNT_OFFSET)
#define STM32_TIM3_PSC            (STM32_TIM3_BASE+STM32_GTIM_PSC_OFFSET)
#define STM32_TIM3_ARR            (STM32_TIM3_BASE+STM32_GTIM_ARR_OFFSET)
#define STM32_TIM3_CCR1           (STM32_TIM3_BASE+STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM3_CCR2           (STM32_TIM3_BASE+STM32_GTIM_CCR2_OFFSET)
#define STM32_TIM3_CCR3           (STM32_TIM3_BASE+STM32_GTIM_CCR3_OFFSET)
#define STM32_TIM3_CCR4           (STM32_TIM3_BASE+STM32_GTIM_CCR4_OFFSET)
#define STM32_TIM3_DCR            (STM32_TIM3_BASE+STM32_GTIM_DCR_OFFSET)
#define STM32_TIM3_DMAR           (STM32_TIM3_BASE+STM32_GTIM_DMAR_OFFSET)
#define STM32_TIM3_AF1            (STM32_TIM3_BASE+STM32_GTIM_AF1_OFFSET)
#define STM32_TIM3_TISEL          (STM32_TIM3_BASE+STM32_GTIM_TISEL_OFFSET)

#define STM32_TIM14_CR1           (STM32_TIM14_BASE+STM32_GTIM_CR1_OFFSET)
#define STM32_TIM14_DIER          (STM32_TIM14_BASE+STM32_GTIM_DIER_OFFSET)
#define STM32_TIM14_SR            (STM32_TIM14_BASE+STM32_GTIM_SR_OFFSET)
#define STM32_TIM14_EGR           (STM32_TIM14_BASE+STM32_GTIM_EGR_OFFSET)
#define STM32_TIM14_CCMR1         (STM32_TIM14_BASE+STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM14_CCER          (STM32_TIM14_BASE+STM32_GTIM_CCER_OFFSET)
#define STM32_TIM14_CNT           (STM32_TIM14_BASE+STM32_GTIM_CNT_OFFSET)
#define STM32_TIM14_PSC           (STM32_TIM14_BASE+STM32_GTIM_PSC_OFFSET)
#define STM32_TIM14_ARR           (STM32_TIM14_BASE+STM32_GTIM_ARR_OFFSET)
#define STM32_TIM14_CCR1          (STM32_TIM14_BASE+STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM14_TISEL         (STM32_TIM14_BASE+STM32_GTIM_TISEL_OFFSET)

#define STM32_TIM15_CR1           (STM32_TIM15_BASE+STM32_GTIM_CR1_OFFSET)
#define STM32_TIM15_CR2           (STM32_TIM15_BASE+STM32_GTIM_CR2_OFFSET)
#define STM32_TIM15_SMCR          (STM32_TIM15_BASE+STM32_GTIM_SMCR_OFFSET)
#define STM32_TIM15_DIER          (STM32_TIM15_BASE+STM32_GTIM_DIER_OFFSET)
#define STM32_TIM15_SR            (STM32_TIM15_BASE+STM32_GTIM_SR_OFFSET)
#define STM32_TIM15_EGR           (STM32_TIM15_BASE+STM32_GTIM_EGR_OFFSET)
#define STM32_TIM15_CCMR1         (STM32_TIM15_BASE+STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM15_CCER          (STM32_TIM15_BASE+STM32_GTIM_CCER_OFFSET)
#define STM32_TIM15_CNT           (STM32_TIM15_BASE+STM32_GTIM_CNT_OFFSET)
#define STM32_TIM15_PSC           (STM32_TIM15_BASE+STM32_GTIM_PSC_OFFSET)
#define STM32_TIM15_ARR           (STM32_TIM15_BASE+STM32_GTIM_ARR_OFFSET)
#define STM32_TIM15_RCR           (STM32_TIM15_BASE+STM32_GTIM_RCR_OFFSET)
#define STM32_TIM15_CCR1          (STM32_TIM15_BASE+STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM15_CCR2          (STM32_TIM15_BASE+STM32_GTIM_CCR2_OFFSET)
#define STM32_TIM15_BDTR          (STM32_TIM15_BASE+STM32_GTIM_BDTR_OFFSET)
#define STM32_TIM15_DCR           (STM32_TIM15_BASE+STM32_GTIM_DCR_OFFSET)
#define STM32_TIM15_DMAR          (STM32_TIM15_BASE+STM32_GTIM_DMAR_OFFSET)
#define STM32_TIM15_AF1           (STM32_TIM15_BASE+STM32_GTIM_AF1_OFFSET)
#define STM32_TIM15_TISEL         (STM32_TIM15_BASE+STM32_GTIM_TISEL_OFFSET)

#define STM32_TIM16_CR1           (STM32_TIM16_BASE+STM32_GTIM_CR1_OFFSET)
#define STM32_TIM16_CR2           (STM32_TIM16_BASE+STM32_GTIM_CR2_OFFSET)
#define STM32_TIM16_DIER          (STM32_TIM16_BASE+STM32_GTIM_DIER_OFFSET)
#define STM32_TIM16_SR            (STM32_TIM16_BASE+STM32_GTIM_SR_OFFSET)
#define STM32_TIM16_EGR           (STM32_TIM16_BASE+STM32_GTIM_EGR_OFFSET)
#define STM32_TIM16_CCMR1         (STM32_TIM16_BASE+STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM16_CCER          (STM32_TIM16_BASE+STM32_GTIM_CCER_OFFSET)
#define STM32_TIM16_CNT           (STM32_TIM16_BASE+STM32_GTIM_CNT_OFFSET)
#define STM32_TIM16_PSC           (STM32_TIM16_BASE+STM32_GTIM_PSC_OFFSET)
#define STM32_TIM16_ARR           (STM32_TIM16_BASE+STM32_GTIM_ARR_OFFSET)
#define STM32_TIM16_RCR           (STM32_TIM16_BASE+STM32_GTIM_RCR_OFFSET)
#define STM32_TIM16_CCR1          (STM32_TIM16_BASE+STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM16_BDTR          (STM32_TIM16_BASE+STM32_GTIM_BDTR_OFFSET)
#define STM32_TIM16_DCR           (STM32_TIM16_BASE+STM32_GTIM_DCR_OFFSET)
#define STM32_TIM16_DMAR          (STM32_TIM16_BASE+STM32_GTIM_DMAR_OFFSET)
#define STM32_TIM16_AF1           (STM32_TIM16_BASE+STM32_GTIM_AF1_OFFSET)
#define STM32_TIM16_TISEL         (STM32_TIM16_BASE+STM32_GTIM_TISEL_OFFSET)

#define STM32_TIM17_CR1           (STM32_TIM17_BASE+STM32_GTIM_CR1_OFFSET)
#define STM32_TIM17_CR2           (STM32_TIM17_BASE+STM32_GTIM_CR2_OFFSET)
#define STM32_TIM17_DIER          (STM32_TIM17_BASE+STM32_GTIM_DIER_OFFSET)
#define STM32_TIM17_SR            (STM32_TIM17_BASE+STM32_GTIM_SR_OFFSET)
#define STM32_TIM17_EGR           (STM32_TIM17_BASE+STM32_GTIM_EGR_OFFSET)
#define STM32_TIM17_CCMR1         (STM32_TIM17_BASE+STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM17_CCER          (STM32_TIM17_BASE+STM32_GTIM_CCER_OFFSET)
#define STM32_TIM17_CNT           (STM32_TIM17_BASE+STM32_GTIM_CNT_OFFSET)
#define STM32_TIM17_PSC           (STM32_TIM17_BASE+STM32_GTIM_PSC_OFFSET)
#define STM32_TIM17_ARR           (STM32_TIM17_BASE+STM32_GTIM_ARR_OFFSET)
#define STM32_TIM17_RCR           (STM32_TIM17_BASE+STM32_GTIM_RCR_OFFSET)
#define STM32_TIM17_CCR1          (STM32_TIM17_BASE+STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM17_BDTR          (STM32_TIM17_BASE+STM32_GTIM_BDTR_OFFSET)
#define STM32_TIM17_DCR           (STM32_TIM17_BASE+STM32_GTIM_DCR_OFFSET)
#define STM32_TIM17_DMAR          (STM32_TIM17_BASE+STM32_GTIM_DMAR_OFFSET)
#define STM32_TIM17_AF1           (STM32_TIM17_BASE+STM32_GTIM_AF1_OFFSET)
#define STM32_TIM17_TISEL         (STM32_TIM17_BASE+STM32_GTIM_TISEL_OFFSET)

/* Basic Timers - TIM6 and TIM7 */

#define STM32_TIM6_CR1            (STM32_TIM6_BASE+STM32_BTIM_CR1_OFFSET)
#define STM32_TIM6_CR2            (STM32_TIM6_BASE+STM32_BTIM_CR2_OFFSET)
#define STM32_TIM6_DIER           (STM32_TIM6_BASE+STM32_BTIM_DIER_OFFSET)
#define STM32_TIM6_SR             (STM32_TIM6_BASE+STM32_BTIM_SR_OFFSET)
#define STM32_TIM6_EGR            (STM32_TIM6_BASE+STM32_BTIM_EGR_OFFSET)
#define STM32_TIM6_CNT            (STM32_TIM6_BASE+STM32_BTIM_CNT_OFFSET)
#define STM32_TIM6_PSC            (STM32_TIM6_BASE+STM32_BTIM_PSC_OFFSET)
#define STM32_TIM6_ARR            (STM32_TIM6_BASE+STM32_BTIM_ARR_OFFSET)

#define STM32_TIM7_CR1            (STM32_TIM7_BASE+STM32_BTIM_CR1_OFFSET)
#define STM32_TIM7_CR2            (STM32_TIM7_BASE+STM32_BTIM_CR2_OFFSET)
#define STM32_TIM7_DIER           (STM32_TIM7_BASE+STM32_BTIM_DIER_OFFSET)
#define STM32_TIM7_SR             (STM32_TIM7_BASE+STM32_BTIM_SR_OFFSET)
#define STM32_TIM7_EGR            (STM32_TIM7_BASE+STM32_BTIM_EGR_OFFSET)
#define STM32_TIM7_CNT            (STM32_TIM7_BASE+STM32_BTIM_CNT_OFFSET)
#define STM32_TIM7_PSC            (STM32_TIM7_BASE+STM32_BTIM_PSC_OFFSET)
#define STM32_TIM7_ARR            (STM32_TIM7_BASE+STM32_BTIM_ARR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Control register 1 */

#define ATIM_CR1_CEN                (1 << 0)  /* Bit 0: Counter enable */
#define ATIM_CR1_UDIS               (1 << 1)  /* Bit 1: Update disable */
#define ATIM_CR1_URS                (1 << 2)  /* Bit 2: Update request source */
#define ATIM_CR1_OPM                (1 << 3)  /* Bit 3: One pulse mode */
#define ATIM_CR1_DIR                (1 << 4)  /* Bit 4: Direction */
#define ATIM_CR1_CMS_SHIFT          (5)       /* Bits 6-5: Center-aligned mode selection */
#define ATIM_CR1_CMS_MASK           (3 << ATIM_CR1_CMS_SHIFT)
#  define ATIM_CR1_EDGE             (0 << ATIM_CR1_CMS_SHIFT) /* 00: Edge-aligned mode */
#  define ATIM_CR1_CENTER1          (1 << ATIM_CR1_CMS_SHIFT) /* 01: Center-aligned mode 1 */
#  define ATIM_CR1_CENTER2          (2 << ATIM_CR1_CMS_SHIFT) /* 10: Center-aligned mode 2 */
#  define ATIM_CR1_CENTER3          (3 << ATIM_CR1_CMS_SHIFT) /* 11: Center-aligned mode 3 */

